HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxSent_regdef.h
/**
 * \file IfxSent_regdef.h
 * \brief
 * \copyright Copyright (c) 2014 Infineon Technologies AG. All rights reserved.
 *
 * Version: TC27XA_TS_V3.0.1.R2
 * Specification: TC27xA_TS_V3.0.1_SFR_OPEN_MARKET.xml (Revision: V3.0.1)
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Sent Sent
 * \ingroup IfxLld
 * 
 * \defgroup IfxLld_Sent_Bitfields Bitfields
 * \ingroup IfxLld_Sent
 * 
 * \defgroup IfxLld_Sent_union Union
 * \ingroup IfxLld_Sent
 * 
 * \defgroup IfxLld_Sent_struct Struct
 * \ingroup IfxLld_Sent
 * 
 */
#ifndef IFXSENT_REGDEF_H
#define IFXSENT_REGDEF_H 1
/******************************************************************************/
#include "Ifx_TypesReg.h"
/******************************************************************************/
/** \addtogroup IfxLld_Sent_Bitfields
 * \{  */

/** \\brief  Access Enable Register 0 */
typedef struct _Ifx_SENT_ACCEN0_Bits
{
    unsigned int EN0:1;                     /**< \brief [0:0] Access Enable for Master TAG ID n (rw) */
    unsigned int EN1:1;                     /**< \brief [1:1] Access Enable for Master TAG ID n (rw) */
    unsigned int EN2:1;                     /**< \brief [2:2] Access Enable for Master TAG ID n (rw) */
    unsigned int EN3:1;                     /**< \brief [3:3] Access Enable for Master TAG ID n (rw) */
    unsigned int EN4:1;                     /**< \brief [4:4] Access Enable for Master TAG ID n (rw) */
    unsigned int EN5:1;                     /**< \brief [5:5] Access Enable for Master TAG ID n (rw) */
    unsigned int EN6:1;                     /**< \brief [6:6] Access Enable for Master TAG ID n (rw) */
    unsigned int EN7:1;                     /**< \brief [7:7] Access Enable for Master TAG ID n (rw) */
    unsigned int EN8:1;                     /**< \brief [8:8] Access Enable for Master TAG ID n (rw) */
    unsigned int EN9:1;                     /**< \brief [9:9] Access Enable for Master TAG ID n (rw) */
    unsigned int EN10:1;                    /**< \brief [10:10] Access Enable for Master TAG ID n (rw) */
    unsigned int EN11:1;                    /**< \brief [11:11] Access Enable for Master TAG ID n (rw) */
    unsigned int EN12:1;                    /**< \brief [12:12] Access Enable for Master TAG ID n (rw) */
    unsigned int EN13:1;                    /**< \brief [13:13] Access Enable for Master TAG ID n (rw) */
    unsigned int EN14:1;                    /**< \brief [14:14] Access Enable for Master TAG ID n (rw) */
    unsigned int EN15:1;                    /**< \brief [15:15] Access Enable for Master TAG ID n (rw) */
    unsigned int EN16:1;                    /**< \brief [16:16] Access Enable for Master TAG ID n (rw) */
    unsigned int EN17:1;                    /**< \brief [17:17] Access Enable for Master TAG ID n (rw) */
    unsigned int EN18:1;                    /**< \brief [18:18] Access Enable for Master TAG ID n (rw) */
    unsigned int EN19:1;                    /**< \brief [19:19] Access Enable for Master TAG ID n (rw) */
    unsigned int EN20:1;                    /**< \brief [20:20] Access Enable for Master TAG ID n (rw) */
    unsigned int EN21:1;                    /**< \brief [21:21] Access Enable for Master TAG ID n (rw) */
    unsigned int EN22:1;                    /**< \brief [22:22] Access Enable for Master TAG ID n (rw) */
    unsigned int EN23:1;                    /**< \brief [23:23] Access Enable for Master TAG ID n (rw) */
    unsigned int EN24:1;                    /**< \brief [24:24] Access Enable for Master TAG ID n (rw) */
    unsigned int EN25:1;                    /**< \brief [25:25] Access Enable for Master TAG ID n (rw) */
    unsigned int EN26:1;                    /**< \brief [26:26] Access Enable for Master TAG ID n (rw) */
    unsigned int EN27:1;                    /**< \brief [27:27] Access Enable for Master TAG ID n (rw) */
    unsigned int EN28:1;                    /**< \brief [28:28] Access Enable for Master TAG ID n (rw) */
    unsigned int EN29:1;                    /**< \brief [29:29] Access Enable for Master TAG ID n (rw) */
    unsigned int EN30:1;                    /**< \brief [30:30] Access Enable for Master TAG ID n (rw) */
    unsigned int EN31:1;                    /**< \brief [31:31] Access Enable for Master TAG ID n (rw) */
} Ifx_SENT_ACCEN0_Bits;

/** \\brief  Access Enable Register 1 */
typedef struct _Ifx_SENT_ACCEN1_Bits
{
    unsigned int reserved_0:32;             /**< \brief \internal Reserved */
} Ifx_SENT_ACCEN1_Bits;

/** \\brief  Channel Fractional Divider Register */
typedef struct _Ifx_SENT_CH_CFDR_Bits
{
    unsigned int DIV:12;                    /**< \brief [11:0] Divider Value (rw) */
    unsigned int reserved_12:4;             /**< \brief \internal Reserved */
    unsigned int DIVM:12;                   /**< \brief [27:16] Measured Divider Value (rh) */
    unsigned int reserved_28:4;             /**< \brief \internal Reserved */
} Ifx_SENT_CH_CFDR_Bits;

/** \\brief  Channel Pre Divider Register */
typedef struct _Ifx_SENT_CH_CPDR_Bits
{
    unsigned int PDIV:12;                   /**< \brief [11:0] Divider Factor of Pre Divider for Channel x (rw) */
    unsigned int reserved_12:20;            /**< \brief \internal Reserved */
} Ifx_SENT_CH_CPDR_Bits;

/** \\brief  Interrupt Node Pointer Register */
typedef struct _Ifx_SENT_CH_INP_Bits
{
    unsigned int RSI:4;                     /**< \brief [3:0] Interrupt Node Pointer for Interrupt RSI (rw) */
    unsigned int RDI:4;                     /**< \brief [7:4] Interrupt Node Pointer for Interrupt RDI (rw) */
    unsigned int RBI:4;                     /**< \brief [11:8] Interrupt Node Pointer for Interrupt RBI (rw) */
    unsigned int TDI:4;                     /**< \brief [15:12] Interrupt Node Pointer for Interrupt TDI (rw) */
    unsigned int TBI:4;                     /**< \brief [19:16] Interrupt Node Pointer for Interrupt TBI (rw) */
    unsigned int ERRI:4;                    /**< \brief [23:20] Interrupt Node Pointer for Interrupt FRI, FDI, NNI, NVI, CRCI, WSI, SCRI (rw) */
    unsigned int SDI:4;                     /**< \brief [27:24] Interrupt Node Pointer for Interrupt SDI (rw) */
    unsigned int WDI:4;                     /**< \brief [31:28] Interrupt Node Pointer for Interrupt WDI (rw) */
} Ifx_SENT_CH_INP_Bits;

/** \\brief  Interrupt Clear Register */
typedef struct _Ifx_SENT_CH_INTCLR_Bits
{
    unsigned int RSI:1;                     /**< \brief [0:0] Clear Interrupt Request Flag RSI (w) */
    unsigned int RDI:1;                     /**< \brief [1:1] Clear Interrupt Request Flag RDI (w) */
    unsigned int RBI:1;                     /**< \brief [2:2] Clear Interrupt Request Flag RBI (w) */
    unsigned int TDI:1;                     /**< \brief [3:3] Clear Interrupt Request Flag TDI (w) */
    unsigned int TBI:1;                     /**< \brief [4:4] Clear Interrupt Request Flag TBI (w) */
    unsigned int FRI:1;                     /**< \brief [5:5] Clear Interrupt Request Flag FRI (w) */
    unsigned int FDI:1;                     /**< \brief [6:6] Clear Interrupt Request Flag FDI (w) */
    unsigned int NNI:1;                     /**< \brief [7:7] Clear Interrupt Request Flag NMI (w) */
    unsigned int NVI:1;                     /**< \brief [8:8] Clear Interrupt Request Flag NVI (w) */
    unsigned int CRCI:1;                    /**< \brief [9:9] Clear Interrupt Request Flag CRCI (w) */
    unsigned int WSI:1;                     /**< \brief [10:10] Clear Interrupt Request Flag WSI (w) */
    unsigned int SDI:1;                     /**< \brief [11:11] Clear Interrupt Request Flag SDI (w) */
    unsigned int SCRI:1;                    /**< \brief [12:12] Clear Interrupt Request Flag SCRI (w) */
    unsigned int WDI:1;                     /**< \brief [13:13] Clear Interrupt Request Flag WDI (w) */
    unsigned int reserved_14:18;            /**< \brief \internal Reserved */
} Ifx_SENT_CH_INTCLR_Bits;

/** \\brief  Interrupt Enable Register */
typedef struct _Ifx_SENT_CH_INTEN_Bits
{
    unsigned int RSI:1;                     /**< \brief [0:0] Enable Interrupt Request RSI (rw) */
    unsigned int RDI:1;                     /**< \brief [1:1] Enable Interrupt Request RDI (rw) */
    unsigned int RBI:1;                     /**< \brief [2:2] Enable Interrupt Request RBI (rw) */
    unsigned int TDI:1;                     /**< \brief [3:3] Enable Interrupt Request TDI (rw) */
    unsigned int TBI:1;                     /**< \brief [4:4] Enable Interrupt Request TBI (rw) */
    unsigned int FRI:1;                     /**< \brief [5:5] Enable Interrupt Request FRI (rw) */
    unsigned int FDI:1;                     /**< \brief [6:6] Enable Interrupt Request FDI (rw) */
    unsigned int NNI:1;                     /**< \brief [7:7] Enable Interrupt Request NNI (rw) */
    unsigned int NVI:1;                     /**< \brief [8:8] Enable Interrupt Request NVI (rw) */
    unsigned int CRCI:1;                    /**< \brief [9:9] Enable Interrupt Request CRCI (rw) */
    unsigned int WSI:1;                     /**< \brief [10:10] Enable Interrupt Request WSI (rw) */
    unsigned int SDI:1;                     /**< \brief [11:11] Enable Interrupt Request SDI (rw) */
    unsigned int SCRI:1;                    /**< \brief [12:12] Enable Interrupt Request SCRI (rw) */
    unsigned int WDI:1;                     /**< \brief [13:13] Enable Interrupt Request WDI (rw) */
    unsigned int reserved_14:18;            /**< \brief \internal Reserved */
} Ifx_SENT_CH_INTEN_Bits;

/** \\brief  Interrupt Set Register */
typedef struct _Ifx_SENT_CH_INTSET_Bits
{
    unsigned int RSI:1;                     /**< \brief [0:0] Set Interrupt Request Flag RSI (w) */
    unsigned int RDI:1;                     /**< \brief [1:1] Set Interrupt Request Flag RDI (w) */
    unsigned int RBI:1;                     /**< \brief [2:2] Set Interrupt Request Flag RBI (w) */
    unsigned int TDI:1;                     /**< \brief [3:3] Set Interrupt Request Flag TDI (w) */
    unsigned int TBI:1;                     /**< \brief [4:4] Set Interrupt Request Flag TBI (w) */
    unsigned int FRI:1;                     /**< \brief [5:5] Set Interrupt Request Flag FRI (w) */
    unsigned int FDI:1;                     /**< \brief [6:6] Set Interrupt Request Flag FDI (w) */
    unsigned int NNI:1;                     /**< \brief [7:7] Set Interrupt Request Flag NNI (w) */
    unsigned int NVI:1;                     /**< \brief [8:8] Set Interrupt Request Flag NVI (w) */
    unsigned int CRCI:1;                    /**< \brief [9:9] Set Interrupt Request Flag CRCI (w) */
    unsigned int WSI:1;                     /**< \brief [10:10] Set Interrupt Request Flag WSI (w) */
    unsigned int SDI:1;                     /**< \brief [11:11] Set Interrupt Request Flag SDI (w) */
    unsigned int SCRI:1;                    /**< \brief [12:12] Set Interrupt Request Flag SCRI (w) */
    unsigned int WDI:1;                     /**< \brief [13:13] Set Interrupt Request Flag WDI (w) */
    unsigned int reserved_14:18;            /**< \brief \internal Reserved */
} Ifx_SENT_CH_INTSET_Bits;

